/* SPDX-License-Identifier: AGPL-3.0-only */
/* SPDX-FileCopyrightText: 2025-2026 Yurii Arkhanhelskyi */
/* Описания доступа, которые ПОКАЗЫВАЕТ СИСТЕМА.
   Не переводы интерфейса: эти строки читает macOS в своём окне запроса,
   и язык там — системный, а не выбранный в настройках приложения.
   Правится вместе с macos/Runner/Info.plist: ключ, которого нет здесь,
   система покажет на языке разработки. */

"NSMicrophoneUsageDescription" = "Secretly використовує мікрофон для голосових і відеодзвінків, а також для запису голосових повідомлень.";
"NSCameraUsageDescription" = "Secretly використовує камеру для відеодзвінків і сканування QR-кодів прив’язки пристроїв.";
"NSPhotoLibraryUsageDescription" = "Secretly використовує доступ до фото, щоб надсилати зображення в чатах.";
"NSDocumentsFolderUsageDescription" = "Secretly використовує доступ до документів, щоб надсилати файли в чатах.";
"NSDownloadsFolderUsageDescription" = "Secretly використовує доступ до завантажень, щоб зберігати файли з чатів.";
"NSDesktopFolderUsageDescription" = "Secretly використовує доступ до робочого столу, щоб надсилати файли та знімки екрана.";
"NSAppleEventsUsageDescription" = "Secretly використовує Apple Events для зв’язку із системними сповіщеннями.";
